{"relation":[["IRC Nickname","stepane","Grundleborg","katastrophe","jtamate","Jannex","Talavis","szotsaki","Frank78ac","hays","Auzon","lemma","joselb","ecki","bala","jael","xsacha","henrikmidtiby","Blauzahl","Med","sahaqiel","FiNeX"],["KDE version used for testing","kubuntu hardy backport KDE 4.0.4","svn trunk r808613","kubuntu 4.0.4","svn trunk r807691 (20080507)","Kubuntu 4.0.4 and 3.5.9","3.5.9 and trunk r807699 r808795","4.0.4 (openSUSE 11 beta offered packages)","3.5.9 and trunk r808111","4.0.4 gentoo-portage","smolt hardware profile])","svn trunk r809039","3.5.9 and kubuntu 4.0.4 with qt4.4","3.5.9 and svn trunk r808533 (qt4.4 final)","Debian, 4:4.0.68+svn794641","kubuntu 4.0.4 with qt4.4","Windows Server 2008 with KDE 4.0.73 and qt4.4","Ubuntu 8.04 with KDE 4.0.3","4.0 branch r802901","3.5.7 and svn trunk r809157","3.5.9 and svn trunk r808114","3.5.9 and svn trunk r806921"],["","","","","","","","","","","","","","","","","","","","","",""]],"pageTitle":"Difference between revisions of \"Contribute/Bugsquad/BugDays/KonquerorDay4\" - KDE TechBase","title":"","url":"https://techbase.kde.org/index.php?title\u003dContribute/Bugsquad/BugDays/KonquerorDay4\u0026diff\u003d26418\u0026oldid\u003d26412","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00200-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":892435435,"recordOffset":892393906,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{14894\u003dThis bug day will take place on Sunday, May 18th 2008, but feel free to start early. The aim of this bug day is to clear as many Konqueror-general bugs as possible. Our target for triage is bugs listed in bugs.kde.org under the product Konqueror, component General.}","textBeforeTable":"  You should either be working with Konqueror from KDE 4 (either 4.0.3 or newer is best or SVN trunk) for testing these bugs. Be sure to join #kde-bugs on irc.freenode.net, as this is where the bug-day will be coordinated. (You can even join now!) The goal of this bug-day is to check for: simple step-by-step instructions, reproducibility, and most of all, come up with test-cases for reproducing the bugs. This will enable the Konqueror developers to deal with bugs more easily, and so have more time left to actually fix them. When you have added either a test-case or step-by-step instructions for the reproduction of a bug, please list it in the appropriate section below, so that a second triager can see if they can get your instructions/test-case to work correctly. This page provides an excellent explanation of how to create a test-case. This page also has useful information on how to not mis-mark bugs. In particular, \"duplicates are hard\". Konqueror doesn\u0027t have as many duplicates as some applications, and we don\u0027t want to claim things are duplicates when they aren\u0027t. So do not look too hard for them, and make sure to double check them with someone else, preferably one of the developers before marking/closing.We especially don\u0027t want to create more work for developers!","textAfterTable":"Debian, 4:4.0.68+svn794641 jael kubuntu 4.0.4 with qt4.4 xsacha Windows Server 2008 with KDE 4.0.73 and qt4.4 henrikmidtiby Ubuntu 8.04 with KDE 4.0.3 Blauzahl 4.0 branch r802901 Med 3.5.7 and svn trunk r809157 sahaqiel 3.5.9 and svn trunk r808114 FiNeX 3.5.9 and svn trunk r806921   Tip Please be sure to sign every bug or comment you add to this page with your irc nickname. You can use the wiki markup ~~~ to insert your wiki username automatically (but only do this if it is the same as your IRC nickname, otherwise write your IRC nickname in by hand). Division of Labour Please choose a month that is not already taken and then query bugs.kde.org for all bugs in that month. Please mark you irc nickname in the table below to show which month\u0027s bugs you are working on to","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}