{"relation":[["","1","2","3","4","5","6","7","8","9","10","11"],["Name","Satellites","Free","The Kiss","Inside of You","Sympathy","Gone With the Wind","Stay","The Whoa Song","Be With You","Colorblind","Calling You Back"],["Artist","Karmina","Karmina","Karmina","Karmina","Karmina","Karmina","Karmina","Karmina","Karmina","Karmina","Karmina"],["Time","3:46","3:29","3:07","3:18","4:52","2:57","4:02","3:31","3:11","4:05","2:57"],["Price","£0.79","£0.79","£0.79","£0.79","£0.79","£0.79","£0.79","£0.79","£0.79","£0.79","£0.79"],["","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes"]],"pageTitle":"iTunes - Music - Backwards Into Beauty by Karmina","title":"","url":"https://itunes.apple.com/gb/album/backwards-into-beauty/id351773714","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00157-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":875173103,"recordOffset":875144730,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{123580\u003dCopyright © 2014 Apple Inc. All rights reserved., 20880\u003dBeautiful ladies with haunting voices, the duo Karmina\u0027s first full-length release, Backwards into Beauty is a delectable serving of mainstream adult alternative music. The album is a true rare musical gem; the voices of Kelly and Kamille Rudisill harmonizing over this 11-track sampling are a great showing of true acoustic talent. Swaying from rocking uptempo beats to glowing ballads, the girls seamlessly string each tune together like a strand of pearls for an impressive listen. The overall feel of the album is a bit of a throwback to the late \u002760s and early \u002770s, reminiscent of Joni Mitchell in a singer/songwriter sense of an artist. Five of the 11 tracks are not new however; the duo released an EP entitled The Kiss in 2006. The tracks from the EP are the strongest for the most part; \"The Kiss,\" \"The Whoa Song,\" and \"Stay\" are all fan favorites where the singing sisters croon over love and loss. There are some new additions that can be highly praised though, such as the sentimental \"Colorblind\" and \"Satellites,\" which act as bookends to the disc. There are no true faults on the album, but some of the songs slush together as many are similar, so when true hits appear (like \"The Kiss,\" one of the strongest alternative adult pop songs in a long time), they are amplified and other tracks seem feeble in comparison (\"Sympathy\" is a solid song, but it fails to hold water against some of the biggest beats). Then again, the quality of the songs overall are so strong, that a \"feeble\" track on this album might be a hit on any other adult alternative album. Overall, the collection is buoyed by strong instrumentals and well-penned lyrics, while the girls sweet personal sounds serve as icing for the songs. The girls define themselves as strong artists who have a set path ahead of them, similar to Anna Nalick or Delta Goodrem. Therefore, Backwards Into Beauty is an exceedingly pleasant pop album that will keep fans and casual listeners enticed with the poise, panache, and the finesse of a duo whose presence on adult alternative music is appreciated and should be anticipated for a long time.}","lastModified":"Thu, 30 Jul 2015 05:22:37 GMT","textBeforeTable":"Open iTunes to preview, buy and download music. View More by This Artist Karmina Backwards Into Beauty iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Backwards Into Beauty by Karmina, download iTunes now. iTunes is the world\u0027s easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn\u0027t open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.","textAfterTable":"11 Songs Album Review Beautiful ladies with haunting voices, the duo Karmina\u0027s first full-length release, Backwards into Beauty is a delectable serving of mainstream adult alternative music. The album is a true rare musical gem; the voices of Kelly and Kamille Rudisill harmonizing over this 11-track sampling are a great showing of true acoustic talent. Swaying from rocking uptempo beats to glowing ballads, the girls seamlessly string each tune together like a strand of pearls for an impressive listen. The overall feel of the album is a bit of a throwback to the late \u002760s and early \u002770s, reminiscent of Joni Mitchell in a singer/songwriter sense of an artist. Five of the 11 tracks are not new however; the duo released an EP entitled The Kiss in 2006. The tracks from the EP are the strongest for the most part; \"The Kiss,\" \"The Whoa Song,\" and \"Stay\" are all fan favorites where the singing sisters croon over love and loss. There are some new additions that can be highly praised though, such as the sentimental \"Colorblind\" and \"Satellites,\" which act as bookends to the disc. There are no true faults on the album, but some of the songs slush together as many are similar, so when true hits appear (like \"The Kiss,\" one of the strongest alternative adult pop songs","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}