{"relation":[["IRC Nickname","Lemma","slangkamp"],["KDE version","not compiled","4.4.5"],["Krita version","not compiled","svn trunk"],["CPU","Q6600","Core i5"],["RAM","8 GB","4 GB"],["Graphics hardware","NVIDIA 8600 GTS","Radeon HD 545v"],["Driver","binary (version coming soon)","fglrx"]],"pageTitle":"Contribute/Bugsquad/BugDays/KritaDay1 - KDE TechBase","title":"","url":"https://techbase.kde.org/index.php?title\u003dContribute/Bugsquad/BugDays/KritaDay1\u0026oldid\u003d53813","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00140-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":872437667,"recordOffset":872415333,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{4346\u003dThis bug day will take place on Sunday, August 22nd 2010, but feel free to start early. The aim of this bug day is to test the specific Krita bugs on as many different platforms as possible.}","textBeforeTable":"  You should be working with KDE SC 4.4 and you absolutely HAVE TO use Krita compiled from trunk. Instructions are available on the following page: http://wiki.koffice.org/index.php?title\u003dBuilding/Building_KOffice Be sure to join #kde-bugs on irc.freenode.net, as this is where the bug-day will be coordinated. (You can even join now!) If possible, triage every bug in the list. Different bugs can behave differently depending on the platform you run Krita on. Goals of this Bug Day This bug day will take place on Sunday, August 22nd 2010, but feel free to start early. The aim of this bug day is to test the specific Krita bugs on as many different platforms as possible. Introduction 3.20 bug #242800 3.19 bug #244910 3.18 bug #245127 (fixed) 3.17 bug #214632 3.16 bug #231950 3.15 bug #239977 3.14 bug #245565 3.13 bug #247791 (closed - works) 3.12 bug #239836 3.11 bug #242505 3.10 bug #243687 3.9 bug #245143","textAfterTable":"Keep this page updated! After triaging a bug which is still reproducible for you it would be great if you could add yourself to the CC field in bugzilla to get informed about updates. This way you can see if it\u0027s worth retrying if the bug has gone away in later versions. Sign-in Tell developers what you are testing with. Please note your version of KDE SC (or the revision number if running from trunk). Please also note your version of Krita as well as the CPU, the amound of RAM, your video hardware and drivers you\u0027re running with. Please give distro/version or SVN branch/trunk with revision below: IRC Nickname KDE version Krita version CPU RAM Graphics hardware Driver Lemma not compiled not compiled Q6600 8 GB NVIDIA 8600 GTS binary (version coming soon) slangkamp 4.4.5 svn trunk Core i5 4 GB Radeon HD 545v fglrx   Tip Please be sure to sign every","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}