{"relation":[["Actor","Edit Delete Edit localized... View CVT Andrew Shephard","Edit Delete Edit localized... View CVT Pat Evison","Edit Delete Edit localized... View CVT Kym Gyngell","Edit Delete Edit localized... View CVT Danielle Spencer","Edit Delete Edit localized... View CVT Kurt Ludescher","Edit Delete Edit localized... View CVT Mark Hennessy","Edit Delete Edit localized... View CVT Jan Friedl","Edit Delete Edit localized... View CVT Adrian Wright","Edit Delete Edit localized... View CVT Ross Thompson","Edit Delete Edit localized... View CVT Max Phipps"],["Character","Steven Wilson","Gran","Jim Shilling","Emma","George","Tony","Miss Melrose","Kurt","Damien Hardy","Mr. Zachary"],["Special Performance Type","-","-","-","-","-","-","-","-","-","-"],["Character note","-","-","-","-","-","-","-","-","-","-"]],"pageTitle":"What The Moon Saw - Freebase","title":"","url":"http://www.freebase.com/m/0c36q6q","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00040-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":456495771,"recordOffset":456466303,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{72668\u003dWhat the Moon Saw is a 1990 Australian film directed by Pino Amenta. It was the first of five... [ + ], 73098\u003dWhat the Moon Saw is a 1990 Australian film directed by Pino Amenta. It was the first of five movies Boulevard Films made following the success of Boulevard of Broken Dreams and was based on Howson\u0027s memories of being a child actor in the theatre. The musical performed in the film, Sinbad\u0027s Last Adventure was written by Howson. [ - ]}","lastModified":"Sat, 01 Aug 2015 04:16:35 UTC","textBeforeTable":"Web Link(s) (deprecated) /common/topic/webpage View history Query by property Flag as reviewed Flag as having unknown values Flag as having no values Add new value http://wp/en/37340220 - Freebase Data Team - Document What The Moon Saw is a 1990 film written by Frank Howson and directed by Pino Amenta. Article Article (deprecated) /common/topic/article View history Query by property Flag as reviewed","textAfterTable":"Edit Delete Edit localized... View CVT Kurt Ludescher George - - Edit Delete Edit localized... View CVT Mark Hennessy Tony - -","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}