{"relation":[["Town","Abbeyville","Aberdeen","Allen","Almont","Alpine Station","Anthracite","Argenta","Ashcroft","Aspen","Bacon","Baldwin","Baldwin (New)","Baldwin (Old)","Bardine","Barnum","Belleview","Bittner","Bogan\u0027s Camp","Bonita","Bowerman","Bowman","Braddock","Cameltown","Cameron","Cameville","Camp Bowerman","Camp Creek","Camp Crescent","Camp Genter","Camp Harbert","Camp Sterling","Camp Willard","Castleton","Cebolla","Cebolla Hot Springs","Chair Creek","Chance","Chaney","Chipeta","Chloride","Citizen","Clarence","Claud","Cloud City","Cochitopa","Conger","Cookville","Cooper\u0027s Camp","Copperville","Cosden","Cotterville","Cox","Crested Butte","Crookstown","Crookstown / Crooksville","Crystal","Curran","Dayton","Del Dorita","Delta","Denny\u0027s","Dinner Station","Dollard","Dorchester","Doyleville","Drake","Drew","Dubois","Eagle City","El Tinjos","Elgin","Elk Creek","Elkhorn","Elko","Elko","Elkton","Emma","Fisher\u0027s Ranch","Floresta","Forest Hill","Fortch\u0027s","Floresta","Fulton","Galena","Garfield City","Gateview","Gilman","Glacier Siding","Glenwood","Gold Creek","Gold Link","Goose Creek","Gothic","Grandville","Grand Junction","Gunnison","Haig","Halls","Haverly","Hawxhurst","Healsburg","Hidalgo","Hillerton","Holland","Hopewell","Hotchkiss","Howeville","Iola","Iris","Irwin","Jacks Cabin","Jackson","Kannah","Kebler","Kezar","Kubler","Lake City Junction","Lake\u0027s Camp","Lawrence","Lodge","Lorraine","Los Pinos","Madera Siding","Maple Leaf","Marble","Marshalltown","Maurice","Midway","Minaret","Minersville","Montrose","Morris","Moscow","Mount Carbon","Naturita","North Star","Northstar","Nugget City","Nugget City","Oh-Be-Joyful","Ohio City","Old Man\u0027s Cabin","Oliver","Omega","Orson","Oversteg","Paonia","Paradox","Parlin","Petersburg","Pieplant","Pitkin","Pittsburgh","Powderhorn","Prospect","Providence","Quarry Town","Quartz","Quartzville","Ragged Mountain","Red Mountain","Redwood","Richardson","Richardson\u0027s Colony","Roaring Fork","Rood City","Ruby","Ruby City","Sage","Sandy Hook","Sapinero","Sargents","Schofield","Sheep Mtn","Sherrod","Sidney","Sillsville","Silver Center","Silver Gate","Smith Hill","Snowmass City","Soap Creek","Somerset","Spencer","Spring Creek City","Standish","Stevens","Stonington","Suttle","Taylor City","Taylor Park","Taylorville","Telco","Tellurium","Tin Cup","Toliafaro","Tomichi","Tucker","Tucson","Tumichi","Turner","Uncompaghre","Union Hill","Ute","Virginia City (Tin Cup)","Vulcan","Wagon Town","Wattson\u0027s Camp","Waunita","Waunita Hot Springs","West Gunnison","White Cloud","White Earth","White Pine","Willis","Woodstock","Youman","Yule Creek"],["Dates","1882-1884","1890-1891","1881-1892","1882-1913","","1887-1947","1880-1881","1880-1912","1880-Present","","1883-1949","1884-1949","1883-?","1903-1908","1876-1881","1880-1881","1905-?","","","1903-1910","1880-1915","","1881","1893-1920","1882-1890","","1894","1881","1925-1930","1880","?-1904","1880-1881","1882-1894","1888-1935","","","1894-1901","1892-1894","1881-1882","1881-1882","","1881-1892","","","","","","","1897","1883-1893","1880-1883","1903-1905","1879-Present","1904-1906","1878-1885, 1904-1906","1881-1909","1880-1880","1897-1911","1882-1883","1882-Present","1879","1880s","1960s-Present","1896-1912","1876-1969","1881-1882","1884-1886","1892-1910","","1883-1893","1882-1885","","","1874-1901","1881-1884","1881-1893","1881-1882","1882-1913","1880-1918","1881-1920","","1897-1919","1894","1880","1880-1883","1892-1895","1882-1883","1914-1915","1876-1884","","?-1913","","1879-1914","","1882-Present","1876-Present","","","1880-1880","1882-1892","1883-1893","1881","1879-1882","","","1882","1879-1904","1896-1963","1894-1902","1879-1890","1909-1918","1873-1893","1882-1882","?-1917","1882-1896","1881-1946","","","1883-1884","1911-1920","1903-1906","1877-1881","","?-1907","1890-1942","1880","","1894-1902","1890-1896","1861","1882-Present","1886-1935","1881-1952","1884-1909","1882-Present","1889-1894","1900-1903","","1895-1898","1880-1882","1880","1879","","","1882-1883","1882-1905","1882-Present","1882","1877","1880-1881","1896-1910","1879","1881-1896","1876-1881","1886-1890","1898-1900","","1879-1934","1879-1879","1919-1956","1880-1881","1883-1893","1882","","1880-1880","1880-1881","1879-1895","","1880-1882","","1882-1986","1880","1879-1885","","1903-1906","1881-1882","1903-1910","","","1876","1880-1886","","1903","1893-1920","1880-1881","1885-1886","1881-1882","","1882-1883","1900","","1882","1917-1929","1880-1883","1880-Present","1896-1898","1876-1899","1896-1897","1880-1882","","1881-1952","1880-1906","","1882-1882","1879-1880","1894-1912","1883-1893","1890s","1885-1908","1910-1942","","","1876-1880","1880-1954","1879","1881-1884","",""],["Comments","formerly Hillerton, 2 mi N of Tin Cup, abandoned. Founded by C.F. Abbey.","7 mi SW of Gunnison","stagestop, formerly Barnum, located at confluence of Indian Creek and Lake Fork of the Gunnison River, PO moved to nearby Gateview in 1892","formerly Fisher\u0027s Ranch","on W end of Alpine Tunnel, RR facility for workers servicing the tunnel. All buildings but the depot were destroyed by fire in 1906. Although parts of the town were rebuilt, the railroad tunnel was abandoned in 1910. The Forest Services maintains an informational display for visitors.","Ghost Town aka Smith Hill and Cloud City, coal mining camp N of Crested Butte servicing Smith Hill Mine. 6 men were killed in an 1883 avalanche. Several building remain.","renamed Tomichi","formerly Chloride","now in Pitkin Co.","ghost town NE of Almont","the name Baldwin applied to 3 distinct places which were near each other. Baldwin the RR stop became Castleton.","serviced the Mount Carbon and Alpine coal Mines, renamed Mount Carbon","Company town owned by Rocky Mtn Fuel Company which serviced the Baldwin Coal Mine. When the mine was abandoned so was the town and so was the name. New Baldwin took the name.","RR stop close to Somerset","stagestop at confluence of Indian Creek and Lake Fork of Gunnison River, renamed Allen in 1881 when Benjamin Allen purchased the ranch. Later the post office was moved a short distance away to Gateview.","mining camp 2 mi from Gothic, abandoned","","small way station for teamsters in Spring Creek Canyon equi-distant between Moscow and Almont","NW of Doyleville, RR siding on Marshall Pass","Bowerman was a town founded upon a hoax. JC Bowerman announced in 1903 that he had discovered huge amounts of gold in Hot Springs Creek above Waunita Hot Springs. The town was abandoned after the hoax was discovered. Some ruins remain along FR 763. It was also known as Nugget City and Camp Bowerman.","formerly Grandville, stage stop on Taylor Pass. It was renamed Bowman when John Bowman ran the site. Abandoned.","camp NE of Almont","Founded by Al Campbell, it was located 2 mi E of Carter Mine on Gold Creek, destroyed when mine was expanded, aka Campbelltown","mining camp, renamed Spencer","","See Bowerman","aka Vulcan","Short lived mining camp at the base of Granite Mountain on South Quartz Creek.","abandoned","renamed Forest Hill","Ghost Town located near Bowerman and named after founder K.C. Sterling","Founded by gold prospectors Willard Frances and H.C. Nicholas on Cochetopa Creek. The ore turned out to be low grade and the site was abandoned.","Coal town at confluence of Carbon Creek and Ohio Creek.","site now under Blue River Mesa","Located next to Powderhorn. It was founded by AJ Store who built a hotel and bathhouses at the site.","at junction of Chair Creek and Crystal River","Abandoned mining camp in Southern Gunnison County near Saguache County line.","","renamed Naturita","formerly Ashcroft \u0026 renamed Ashcroft again","camp near Baldwin","Located at the junction of Carbonate Creek and Rock Creek, next to the town of Marble, and in 1890 the two towns merged into Marble. It was founded by John Mobley and William Mason.","W of Crested Butte, may be same as Cloud City","See Anthracite, 4 miles from Crested Butte, may be same as Claud","Ute Agency E of Gunnison","camp on Spring Creek NE of Almont","on D\u0026RGW RR, SE of Crooksville","NE of Crested Butte","at mouth of Rudolph Gulch along Cebolla Creek, abandoned. Serviced the Cashier copper mine. No buildings remain.","Formerly Wagon Town, Healsburg, El Tinjos, and Redwood. It was stage station at junction of Canyon Creek and Tomichi Creek. The remains of the old smelter can still be seen.","renamed Garfield","","Crested Butte, coal mining town founded by Howard F. Smith and his partners. The coal was used to fire the Colorado Fuel and Iron Smelter in Pueblo. The last coal mine shut down in the 1960s. Crested Butte began a new era as a ski resort when the first gondola built in 1962.","D\u0026RGW RR station 24 miles from Gunnison","D\u0026RGW RR station 24 miles from Gunnison. Founded by Cyrus Crooks. Also known as Crookstown and Crookston. Contained a section house, water tank, Post Office and School.","It began as a silver mining camp and its power plant supplied the Sheep Mountain Tunnel. It is accessible by a poor, nail-biting 4 wheel drive road from Marble. The power plant is one of the most photographed structures in Colorado. See it\u0027s photograph at the top of this page. In 1884 a Mr. Howell began the first marble quarry near Crystal. Some structures have been restored for seasonal use.","","located S of Gateview along Lake Fork of Gunnison River, RR stop and post office.","mining camp on Deldorado Creek, 1 mi E of White Earth. The town was abandoned after 1 year.","now in Delta Co.","aka Willis, abandoned","abandoned","NW of Gunnison","formerly Taylor City, on Taylor Pass, 2 miles below Bowman. Serviced the Star Mine and Enterprise Mine. In 1900 it was a stopping place for travelers coming from Aspen via Taylor Pass. Abandoned.","Named for homesteader Henry Doyle. It was briefly named Gilman, stage stop for Barlow \u0026 Sanderson stage, RR stop on Marshall Pass","","","on Goose Creek NW of Powderhorn, formerly called Goose Creek. Abandoned.","renamed Ohio City","renamed Cosden","PO moved to Waunita","","","mining camp, near Schofield and Elko Lake on South Fork of Crystal River. Founded by Willis McGlothlen. Also called Golconda. Served the Golconda Mine, Slim Jim Mine, Duke of Wellington, Hard Cash and Pride of Cinnamon Mines.","RR siding on Marshall Pass for loading hay and lumber","Silver mining camp at head of Washington Gulch, N of Crested Butte. It was founded by prospectors M.J. Gray and Joseph McCay. At some point in its history it burned. It is still occupied by seasonal residents.","","became Almont","founded as Ruby-Anthracite, renamed Floresta in 1901, abandoned","formerly Camp Harbert, on Trail Creek W of Taylor Park road, abandoned. Founded by Marion Harbert.","on Crystal River","Originally called Ruby - Anthracite. Located west of Crested Butte in the Anthracite Creek area. A narrow gauge rail was built from Crested Butte to the site to haul coal. The town name changed when the Ruby-Anthracite mine closed and the Floresta Mine opened in 1901. Some ruins remain and the site is accessible by foot along the old rail line.","aka Vulcan","mining camp 3/4 mi N of Schofield Pass","formerly Cotterville, 4 mi S of Virginia City, burned","formerly Allen, stagestop on Lake Fork of Gunnison River, superseded by Dayton.","formerly Doyleville \u0026 renamed Doyleville again","","near headwaters of Tomichi Creek, 1/2 mi above town of Tomichi, wiped out in 1884 avalanche","aka Ohio City","mining camp 1 mi N of Raymond Mine, near Ohio City","renamed Dubois","mining town on East River N of Crested Butte. President Grant visited the town in 1880. Gothic was all but abandoned by 1914 and had only 1 resident, Garwood H. Judd. In 1928 town was purchased and restored by Dr. John C. Johnson and the Rocky Mtn Biological Laboratory.","became Bowman","formerly Ute, now in Mesa Co.","Gunnison, formerly Richardson\u0027s Colony","RR siding on Marshall pass, used by Trinchera Lumber Co","8 miles W of Gunnison","","now in Mesa Co.","renamed Cosden","abandoned, just N or Pittsburgh","located 2 mi N of Tin Cup, became Abbeyville. Named after Edwin H Hiller. Most building were eventually moved to Abbeyville or Tin Cup.","at junction of Milton Creek and Crystal River","Located on Coal Creek north of Kebler Pass in the Ruby Gulch area.","now in Delta Co.","became Jack\u0027s Cabin","The buildings and PO were moved from Kezar in 1896. It became a resort on the Gunnison River and had a RR stop. It has now been buried under Blue Mesa Reservoir.","formerly Union Hill, mining camp located just over the border in Saguache County.","Founded by 2 mining engineers, Irwin was located a quarter-mile from Ruby City. For awhile the towns were called Ruby-Irwin and finally just Irwin.By 1883 only the Forest Queen, Bullion King and Ruby Chief mines were still producing. Located on Coal Creek north of Kebler Pass in the Ruby Gulch area.","formerly Howeville","","","lumber camp on Ohio Pass road at base of Kebler Pass. Nothing remains.","formerly Stevens, PO moved to Iola","mining camp SW of Crested Butte, near mine of same name.","","See North Star.","PO moved to Dallas, now in Ouray Co.","","Abandoned, 1 mi S of Bowerman. It probably began as a result of the same hoax that started Bowerman.","PO moved from Uncompaghre, now in Montrose Co.","","The Maple Leaf Mine is located just north of Sillsville on the east side Colo 114. It had a bunkhouse, boarding house and a stamp mill. Abandoned","Located on the confluence of Carbonate Creek and the Crystal River west of Redstone. Early miners in the area, including Sylvester Richardson and George Yule had noticed that the claims along Yule Creek had marble ceilings. The town was laid out by William Woods and William Parry. Formerly called Yule Creek. In 1885 the first marble quarrying operations began on Yule Creek, however they were on a small scale until the arrival of the railroad from Carbondale in 1906. The quarry provided the marble for the Colorado State Capitol, the Tomb of the Unknown Soldier and the Lincoln Memorial. Operations ceased in 1941. In 1990 operations resumed. Marble is accessible by paved county highway and is still inhabited.","renamed Sargents","mining camp near Marble","mining camp on Willow Creek between Spencer and Vulcan.","","abandoned, on E side of Anthracite Mesa in Washington Gulch, below Painter Boy mine, near Elkton","now in Montrose Co.","Mr. Horne and Mr. Mallette founded the town in 1886 and developed the Old Lot mining claim. It is located at junction of highway 149 and 27RD near Powderhorn, aka Tucker.","formerly Turner, on Spring Creek, mining camp supporting Doctor Mine, abandoned.","It was located on Ohio Creek NW of Castleton. Founded by William Hinds as a coal mining camp servicing the Mount Carbon and Alpine Mines, It was burned and abandoned. Later the mine was re-opened as the Alpine Mine. After the mine at \"Old\" Baldwin closed, the town of Mount Carbon and/or Alpine was re-named Baldwin (New). It closed for good in 1946. Some buildings remain.","formerly Chipeta, now in Montrose Co.","formerly Lake\u0027s Camp, abandoned. Founded by Henry Lake. Serviced the North Star and May-Mazeppa mines. Abandoned.","","See Bowerman","renamed Toliafero, on Goose Creek near Dubois, abandoned","Located on Oh-Be-Joyful Creek N of Crested Butte, renamed Tucson","Located on the rail line between the Alpine Tunnel and Gunnison. It was also known as Gold Creek and Eagle City, located at confluence of Gold and Quartz Creeks. By the 1940s only 50 or so people remained. It is now occupied seasonally.","aka Willis, abandoned","NW corner of County, RR stop","abandoned","","","now in Delta Co.","now in Montrose Co.","formerly Tumichi, name changed to Parlin in 1880, stage station and transfer point for RR on Marshall Pass. Founded by John Parlin.","renamed Spring Creek City","Mining camp located in Taylor Creek drainage off FR742, founded by James Jenkins and John Lynch. Several buildings remain","Gold and Silver mining camp on Quartz Creek. It was formerly called Quartz \u0026 Quartzville. It was also a rail stop on the line between Gunnison and the Alpine Tunnel. The town burned in 1989 and 1903. It is now a fish hatchery. Visit town link at left.","silver mining camp N of Crested Butte on Slate Creek. It served the Augusta, Black Queen and Excelsior Mines. It now has some new homes.","Located 1.5 miles northwest of White Earth on Cebolla Creek. It was also a stage stop.","at junction of Rapid Creek and Crystal River, 3 miles from Marble.","abandoned","Worker camp at the Yule Creek White Marble quarry.","located near confluence of Middle and North Quartz Creek, abandoned, no buildings remain.","renamed Pitkin","SW of McClure Pass","","renamed Cosden","in Ohio Creek Valley, renamed Baldwin, then Castleton. Named for Sylvester Richardson who began a coal mine in the area.","renamed Gunnison","","renamed Spring Creek City","formerly Haverly and Silver Gate, became Haverly again","Founded by land promoter Charlie Chrispher, it was located only a quarter mile from Irwin, it was also known for awhile as Ruby-Irwin. Eventually it became part of Irwin. See Irwin.","","mining camp on Gold Creek near Ohio City","formerly Soap Creek, site now under Blue Mesa Resv., town was moved above the waterline.","formerly Marshalltown, RR stop on Marshall Pass, containing a roundhouse and depot, actually in Saguache County. Named for founder Joseph Sargent. In 1909 the town burned and little remains.","mining camp, 14 mi SE of Marble on South Fork of Crystal River. Named for B.F. Schofield. Also called Scofield. 1 building remains.","aka Snowmass City","Abandoned mining camp named for W.H. Sherrod, aka Camp Sherrod \u0026 Sherrod Switch, on RR switchback to Alpine Tunnel, 1 cabin remains","now in Pitkin Co.","Abandoned Mining camp servicing Sillsville mine, on Cochetopa Creek just north of Camp Willard. Ruins remain and can be seen from Colo 114.","aka Snowmass City","Located on Coal Creek north of Kebler Pass in the Ruby Gulch area.","aka Anthracite","aka Silver Center and Sheep Mtn, 1.5 mi N of Crystal","See Sapinero","NW of Gunnison on Hwy. 133, RR town","mining camp, formerly Cameron, abandoned. Located at head of Wildcat Gulch and just west of Colorado 149.","mining camp on Spring Creek, aka Rood City and Petersburg. Serviced one of Gunnison County\u0027s largest lead-silver claims - the Doctor Mine.","","renamed Kezar in 1882","mining camp near Marble","","renamed Dorchester","E of Taylor Park Resv.","now under Taylor Resv","Abandoned lumber camp on railroad line from Crested Butte to Floresta. Founded by Henry Endner.","mining camp located near head of Tellurium Creek","Mining camp formerly Tin Cup, renamed Virginia City, then renamed Tin Cup again. The town burned in 1906 and 1913. Many original structures have been restored and the town is occupied seasonally.","formerly Nugget City, on Goose Creek, abandoned","on Tomichi Creek 1.5 mi NE of White Pine, formerly Argenta, destroyed by avalanche in 1898, which killed 4 persons. Serviced the Magna Carta Tunnel lode. Cemetery remains.","aka Morris","abandoned mining camp, formerly Oh-Be-Joyful, on Oh-Be-Joyful Creek N of Crested Butte","became Parlin","renamed Moscow","now in Montrose Co.","renamed Iris","became Grand Junction, now in Mesa Co.","name change to Tin Cup","gold, sulphur and copper mining camp located on Camp Creek, formerly Fulton and Camp Creek, now Ghost Town. Serviced the Vulcan, Mammoth Chimney and Good Hope mines. In the early 1900s sulphur was mined and during WWI the mines produced copper.","renamed Cosden","abandoned","PO moved from Elgin","PO moved from Bowerman","","Located on Coal Creek north of Kebler Pass in the Ruby Gulch area.","stage stop on Cebolla Creek 1.5 mi SE of Powderhorn. It was a ranching center and stage stop.","mining camp on Tomichi Creek. The town declined after the United States demonetized silver. Some structures remain.","aka Denny\u0027s and Old Man\u0027s Cabin, abandoned","Mining camp supported by the mines in Brittle Silver Basin on Williams Pass Road (formerly the Alpine and South Park Toll Road), destroyed by avalanche in 1884. The lumberjacks had denuded all trees from the nearby hillsides to build railroad ties. 13 people were killed, including the 6 children of Mrs. Marcella Doyle, the boardinghouse operator. The bodies were probably buried in Pitkin.","in far south of county","became Marble"]],"pageTitle":"Gunnison County Towns and Mining Camps","title":"","url":"http://www.rootsweb.ancestry.com/~cogunnis/cities.htm","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00215-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":686211037,"recordOffset":686195412,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{27441\u003dGold and Silver mining camp on Quartz Creek. It was formerly called Quartz \u0026 Quartzville. It was also a rail stop on the line between Gunnison and the Alpine Tunnel. The town burned in 1989 and 1903. It is now a fish hatchery. Visit town link at left., 22314\u003dLocated on the confluence of Carbonate Creek and the Crystal River west of Redstone. Early miners in the area, including Sylvester Richardson and George Yule had noticed that the claims along Yule Creek had marble ceilings. The town was laid out by William Woods and William Parry. Formerly called Yule Creek. In 1885 the first marble quarrying operations began on Yule Creek, however they were on a small scale until the arrival of the railroad from Carbondale in 1906. The quarry provided the marble for the Colorado State Capitol, the Tomb of the Unknown Soldier and the Lincoln Memorial. Operations ceased in 1941. In 1990 operations resumed. Marble is accessible by paved county highway and is still inhabited., 34246\u003dMining camp formerly Tin Cup, renamed Virginia City, then renamed Tin Cup again. The town burned in 1906 and 1913. Many original structures have been restored and the town is occupied seasonally., 34694\u003don Tomichi Creek 1.5 mi NE of White Pine, formerly Argenta, destroyed by avalanche in 1898, which killed 4 persons. Serviced the Magna Carta Tunnel lode. Cemetery remains.}","textBeforeTable":"             GUNNISON COUNTY TOWNS AND MINING CAMPS Search billions of records on Ancestry.com","textAfterTable":"Return to Home Page Should you have problems, please email the Gunnison County Coordinator","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}