{"relation":[["Name","Lemma","Lemma","Teo","ehamberg","Brandon","friedreich","Johannes Köster","Armando Jagucki","rivo","Nikolavp"],["Card","8600 GTS","8600 GTS","Quadro NVS 140M (same chip as 8400M)","8400GS","8800GTS 640mb","8800GTS 640mb","Geforce 8600GT","Geforce 8800GT","9600GT","8500 GT"],["Kernel","2.6.25","2.6.25","2.6.25","2.6.25","2.6.26","2.6.25.9-2-pae","2.6.25-debian","2.6.24","2.6.22 (Gutsy)","2.6.25-2"],["Version","177.13 (beta)","173.14.09 (stable)","173.14.09 (stable)","173.14.09 (stable)","173.14.09 (stable)","173.14.09 (stable)","173.14.09","173.14.09","173.14.09","173.14.09-3"],["I.P.P.","2","2","2","2","2","2","2","2","2","2"],["G.C.","1","1","1","1","1","1","1","1","1","1"],["Improvement","huge","huge","small","huge","huge(not a lot when resizing windows but scrolling in the folderview is smooth now)","huge (after playing with advanced compositing options absolutely smooth (opengl, texture from pixmap, trilinear, direct rendering), keep thumbnails of hidden windows), still dogslow when adding widgets and doing animations the 1st time, putting the lines into xorg.conf doesn\u0027t work","rather big, but only if I use shared memory as opengl mode. texture from pixmap causes long hangs every few minutes.","Huge. Scrolling in folder views does not lag anymore, and the desktop switching window-shuffle animation is silky smooth whereas before it would hiccup.","huge. Plasma is now actually usable (was very painful before). KWin is also very smooth now.","Huge difference, saved my day."]],"pageTitle":"User:Lemma/KDE4-NVIDIA - KDE TechBase","title":"","url":"https://techbase.kde.org/index.php?title\u003dUser:Lemma/KDE4-NVIDIA\u0026oldid\u003d31009","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00066-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":882793083,"recordOffset":882778113,"tableOrientation":"HORIZONTAL","textBeforeTable":"Here I\u0027d like to collect some information about the circumstances this setup will work better in. Please post your experiences to the table below: Experiences ... EndSection \"Device\" ... Option \"GlyphCache\" \"1\" Option \"InitialPixmapPlacement\" \"2\" ... Section \"Device\" ...  Driver options set using the nvidia-settings tool reset back to default as soon as your xserver exits. To make it permanent you can add the options to the Device section of your xorg.conf:       While I saw this setting in someone\u0027s xorg.conf I couldn\u0027t actually make it work for me. Hints welcome!   Note     Making it permanent Apart from that I had to play around with the Advanced Effects settings as kwin\u0027s performance seemed to have dropped. If you\u0027re lucky your KDE4 will be snappier than ever. If you\u0027re unlucky and it stays the same or gets even worse, try experimenting with the value of InitialPixmapPlacement, setting it to 1 or 3. Set the following options: $ nvidia-settings -a InitialPixmapPlacement\u003d2 -a GlyphCache\u003d1 Make sure you the NVIDIA kernel module gets loaded by either rebooting or rmmod/modprobe (Of course you\u0027ll also have to restart xorg) Install the latest NVIDIA graphics driver (173.14.09 works fine for me)    ","textAfterTable":"I.P.P. \u003d InitialPixmapPlacement G.C. \u003d GlyphCache Known problems I haven\u0027t done a lot of testing using this setup, so in case you encounter any unwanted effects (on 3D applications or other 2D applications), please put them below. Following those steps with cards from the 7xxx series is said to increase GPU temperature a lot. [1] On changing kwin\u0027s effects settings might not be possible because on applying the changes X might freeze for a period of time longer than the 10 seconds you have to confirm the change. The Yakuake terminal has scrolling problems after these changes, it also takes long to appear / disappear, regardless of the animation speed you set.   Warning I do not suggest running BETA quality software (especially drivers) on any system. This page merely describes what I did to my system and how it worked out - don\u0027t expect the same and don\u0027t blame me if your system crashes.","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}