{"relation":[["IRC Nickname","Lemma","jtamate","Dario_Andres"],["KDE version used for testing","svn trunk r958924","opensuse r954171","trunk 958964"],["Graphics driver","NVIDIA 185.19","free ati radeon","intel2.6.3"],["Qt","qt-copy","4.5.1","4.5.0+942255"],["X","1.6.1","1.6","1.6.1"]],"pageTitle":"Contribute/Bugsquad/BugDays/PlasmaDay1 - KDE TechBase","title":"","url":"https://techbase.kde.org/index.php?title\u003dContribute/Bugsquad/BugDays/PlasmaDay1\u0026oldid\u003d41139","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00092-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":903695923,"recordOffset":903669554,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{6805\u003dThis is the page for PlasmaDay1 which takes place on Saturday/Sunday, April 25th/26th 2009, but feel free to start early. The aim of this bug day is to organize as many of the Plasma bugs as possible, identifying duplicate bug reports and already fixed bugs. Our targets for triage are bugs listed in bugs.kde.org under the product plasma.}","textBeforeTable":"  Please list bugs here to get a second opinion before making the change in bugzilla. This also gives a record of what we\u0027ve done for the developers to check. Double Check! Prioritizing is good. We\u0027re especially interested in problems that result in an unuseable desktop. Let\u0027s keep track of them. Is it a big bug? If something has no clear instructions on how to reproduce it, or has little useful information, add a comment asking the reporter for more detail. Then list it in the bugs awaiting feedback section. Be polite, we want to be nice to our bug reporters! Unclear Some bugs might have documents that expose the bugs attached, for some bugs you might be able to create data that shows the buggy behaviour. In both cases we have to add the testcase keyword. If you lack permissions to do so, additionally add the bug to the \"Needs testcase keyword\" section. Testcases If you\u0027re done with your batch, pick another one and start from the top :-) Mark the bug as triaged by adding the triaged keyword on the bug. Again if you lack the permissions to do so, additionally put it in the \"Needs triaged keyword\" section. Check if","textAfterTable":"Tip Please be sure to sign every bug or comment you add to this page with your irc nickname. You can use the wiki markup ~~~ to insert your wiki username automatically (but only do this if it is the same as your IRC nickname, otherwise write your IRC nickname in by hand). Common Bugs There are some bugs which are commonly reported several times. If you found such a bug (or think you did), you can put it here: Sign-in Tell developers what you are testing with. (If you expect to upgrade between now and BugDay, put what version you are using now next to the bugs/comments that you put on this page.) Please give distro/version or SVN branch/trunk with revision below (or just beta2 if you\u0027re using that). Also put your graphics driver, the version of Qt and X you are using: IRC Nickname KDE version used for testing Graphics driver Qt X Lemma svn trunk r958924 NVIDIA 185.19 qt-copy 1.6.1 jtamate opensuse r954171 free ati radeon 4.5.1 1.6 Dario_Andres trunk 958964 intel2.6.3 4.5.0+942255 1.6.1 Division of Labour Please choose a batch that is not already taken and","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}