{"relation":[["Title","Arthur Locked in the Library","The Big Balloon Race","Bud, Not Buddy","Bug Boy","Catcher in the Rye","The Children\u0027s Story","Hope was Here","Joey Pigza Swallowed the Key","Landry News","A Long Way from Chicago","Nothing but the Truth","The Outsiders","Rewind","Seedfolks","S.O.R. Losers","Stage Fright on a Summer Night (15 books)","Stargirl","Summer Reading is Killing Me","To Kill a Mockingbird","Walk Two Moons","Watsons go to Birmingham, 1963","Westing game"],["Author","Marc Brown","Eleanor Coerr","Christopher Paul Curtis","Carol Sonenklar","J.D. Salinger","James Clavell","Joan Bauer","Jack Gantos","Andrew Clements","Richard Peck","Avi","S.E. Hinton","William Sleator","Paul Fleischman","Avi","Mary Pope Osborne","Jerry Spinelli","John Sciezka","Harper Lee","Sharon Creech","Christopher Paul Curtis","Ellen Raskin"],["Publisher","Little Brown \u0026 Co","Harpercollins","Yearling","Yearling","Lb Books","Dell","Puffin","HarperTrophy","Aladdin","Puffin","Flare","Prentice Hall","Puffin","Harper Collins","Harcourt","Random House","Knopf","Puffin","Little Brown \u0026 Co","HarperTrophy","Bantam Books","Scott Foresman"]],"pageTitle":"Youth Services Book Discussion Kits - South Central Library System","title":"","url":"http://www.scls.info/ys/progsupport/discussion.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00127-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":694214887,"recordOffset":694206685,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{5481\u003dYouth services librarians in the South Central Library System have created extremely successful book discussion programs for the youth of their communities. It can be difficult to place holds on multiple copies of books, so to make things easier SCLS has created book group discussion kits for youth services librarians. Funding for the initial collection of book group kits came from a Wisconsin State Journal/Empty Stocking Club grant in 2002. (Committee members who chose the books for this initial collection were: Linda Colby, Mount Horeb Public Library; Karen Kjensrud, Baraboo Public Library; Maureen Palmer, Reedsburg Public Library; Sue Marie Rendall, Portage County Public Library; and Shawn Brommer, South Central Library System.)}","lastModified":"Fri, 24 Jul 2015 20:26:45 GMT","textBeforeTable":"Kit titles: Please contact Shawn Brommer if you have any questions, comments or to make suggestions for future book kit titles. What is in the kits? There are multiple copies of books and discussion ideas and activities in each book group discussion kit. How long can we keep the kits? Libraries have 6 weeks to distribute, discuss and retrieve books from readers. The loan period for the books is 4 weeks. We suggest that you check books out to your readers as soon as you receive them and collect them as soon as you are finished with your discussion. The two weeks beyond the 4-week loan period should be sufficient time to collect any straggling titles. How do we borrow the kits? Contact SCLS Delivery at: storykits@scls.lib.wi.us or 608/266-6039 to schedule a time to borrow any of the kits. Who can borrow these kits? Youth services librarians/member library staff from the South Central Library System Youth services librarians in the South Central Library System have created extremely successful book discussion programs for the youth of their communities. It can be difficult to place holds on multiple copies of books, so to make things easier SCLS has created book group discussion kits for youth services librarians. Funding for the initial collection of book group kits came from a Wisconsin State Journal/Empty Stocking Club grant in 2002. (Committee members who chose the books","textAfterTable":"  For more information, contact Shawn Brommer. SCLS Home | Youth Services Home Page created 11/03. Page updated 06/14. South Central Library System 4610 South Biltmore Lane Madison, WI 53718 (608) 246-7970 Toll-free: (855) 516-7257","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}