{"relation":[["IRC Nickname","Lemma","jtamate","dtritscher","Brot","santa_","Dario_Andres","Blauzahl"],["KMail version used for testing","svn trunk r939483","4.2.65 (KDE 4.3 \u003e\u003d 20090226)","4.2.1","gentoo-ebuilds 4.2.1","debian experimental packages (4.2.1)","svn rev. 939600 + Qt4.5+patches-936035","svn kdepim r939529 + Qt4.5 patches-935726"],["","","","","","","",""]],"pageTitle":"Difference between revisions of \"Contribute/Bugsquad/BugDays/KMailDay3\" - KDE TechBase","title":"","url":"https://techbase.kde.org/index.php?title\u003dContribute/Bugsquad/BugDays/KMailDay3\u0026diff\u003d39787\u0026oldid\u003d39553","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00281-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":878665695,"recordOffset":878640978,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{24806\u003dThis is the page for KMailDay3 which takes place on Sunday, March 15th 2009, but feel free to start early. The aim of this bug day is to organize as many of the KMail bugs as possible, identifying duplicate bug reports and already fixed bugs. Our targets for triage are bugs listed in bugs.kde.org under the product kmail.}","textBeforeTable":"  Sometimes you might encounter edit conflicts if several people are working on the wiki page at once. We can mostly avoid those by keeping notes of the bugs we encounter in a text editor and file several of them later at once (don\u0027t forget to save). You can edit single sections of this page if you you check Enable section editing via edit links in your TechBase Preferences. [edit] Hints You can use the tag \u003cs\u003e...\u003c/s\u003e to mark a bug as done like this. After adding triaged bugs on this page, you should keep an eye on their bugzilla status. Add yourself on the CC field in bugzilla to be informed about updates. When a bug is closed on bugzilla, it should be updated on this page. [edit] Keep this page updated! Please list bugs here to get a second opinion before making the change in bugzilla. This also gives a record of what we\u0027ve done for the developers to check. [edit] Double Check! Prioritizing is good. We\u0027re especially interested in problems that result in dataloss. Let\u0027s keep track of them. [edit]","textAfterTable":"jtamate 4.2.65 (KDE 4.3 \u003e\u003d 20090226) dtritscher 4.2.1 Brot gentoo-ebuilds 4.2.1 santa_ debian experimental packages (4.2.1) Dario_Andres svn rev. 939600 + Qt4.5+patches-936035 Blauzahl svn kdepim r939529 + Qt4.5 patches-935726 [edit] Division of Labour Please choose a batch that is not already taken and then query bugs.kde.org for all bugs in that batch. Please mark you irc nickname in the table below to show which month\u0027s bugs you are working on to avoid duplication of effort. If you have to leave before you can finish your batch, please put the last bug you triaged as well as if you\u0027re going to finish triaging in the table so others will know where you left off.   Warning With these more recent bugs, if the report has been looked at by a developer (i.e. they cc\u0027d themself or commented on it or posted a patch), and it seems like the","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}