{"relation":[["","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59","60","61","62","63","64","65","66","67","68","69","70","71","72","73","74","75","76","77","78","79","80","81","82","83","84","85","86","87","88","89","90","91","92","93","94","95","96","97"],["Name","CleanThe Last Five Years","CleanBurn the Floor","CleanThe Valkyrie","CleanSCKBSTD","CleanCosi Fan Tutte","CleanThe New Pink","CleanRigoletto","CleanThe Diary of Anne Frank","CleanSwan Lake","CleanNalmes","CleanMass","CleanMusic from the Crooked Road","CleanGarth Fagan Dance","CleanPorgy and Bess","CleanA Raisin in the Sun","CleanAround the World in 80 Days","CleanReal Pirates","CleanDon Giovanni","CleanBilly Bishop Goes to War","CleanThe Daughter of the Regiment","CleanRomeo and Juliet","CleanLa Boheme","CleanGrease","CleanAlive and Well","CleanAn Empty Plate in the Cafe Du Grand Boeuf","CleanWicked","CleanLove Inc.","CleanTOSCA","CleanAvenue Q","CleanGift of the Magi","CleanMoon for the Misbegotten","CleanElixir of Love","CleanSPAMALOT","CleanCentennial Casting","CleanAdia","CleanNixons Nixon","CleanIl Trovatore","CleanMy Fair Lady","CleanART OF MURDER","CleanOf Men and Mice","CleanBlack Watch","CleanALVIN AILEY AMERICAN DANCE THEATE","CleanLost in the Stars","CleanFat Boy","CleanBlack Grace","CleanMetropolitan Opera Company","CleanTitanic","CleanTHE POETRY OF PIZZA","CleanHank Williams","CleanWHISTLE DOWN THE WIND","CleanCHRISTMAS CAROL","CleanPiano Lesson","CleanWHITE CHRISTMAS","CleanBAT BOY The Musical","CleanDIRTY ROTTEN SCOUNDRELS","CleanPirates of Penzance","CleanMAN OF LA MANCHA","CleanTHE K OF D","CleanDoubt","CleanTHE PILLOWMAN","CleanTROUBLE IN TAHITI","CleanBIRMINGHAM ROYAL BALLET","CleanREDUCED SHAKESPEARE COMPANY","CleanAndre Rieu","CleanKING LEAR - The Storm at Home","CleanNORTH STAR","CleanTO KILL A MOCKINGBIRD","CleanCAVALLERIA RUSTICANA","CleanAGRIPPINA","CleanINDOOR/OUTDOOR","CleanSUSANNAH","CleanElephant Man","CleanCarmen","CleanTHE UNIVERSE WITHIN: The Human Body Revealed","CleanPilobolus","CleanJOSEPH AND THE AMAZING TECHNICOLOR DREAMCOAT","CleanAlvin Ailey American Dance Theatre","CleanAll the Great Books","CleanContact","CleanChicago","CleanNorma","CleanAnnie","CleanOf Mice and Men","CleanFrozen","CleanCircus","CleanMarriage of Figaro","CleanPeter Pan","CleanIntimate Apparel","CleanBrokeback Mountain","CleanThree days of rain","CleanLion King","CleanBright Ideas","CleanRomeo et Juliette","CleanEUGENE ONEGIN","CleanPOCAHONTAS","CleanEMMA\u0027S CHILD","CleanLULA WASHINGTON DANCE THEATRE"],["Description","If you are hungry for a literate musical with real melodies and more than passing lyrics...","This dancing extravaganza lends itself to adjectives like sexy, sensual, and sensational and sizzle...","The old myth represents the eagerly anticipated awakening of Earth from the winter into spring...it\u0027s a retelling of the sleeping beauty myth.","Too many songs and too much talking about...","Groag\u0027s Cosi is a frisky, frolic of fun that...","There are many scenes that make for a jolly good walk on the funny side of the street.","The wonderful lyricism of the Verdi score cascades over the audience like a magic waterfall...","By Frances Goodrich \u0026 Albert Hackett, Adapted by Wendy Kesselman, performed by the Virginia Stage Company","Swan Lake is a part of the Virginia Arts Festival.","Nalmes is a part of the Virginia Arts Festival.","Mass is a part of the Virginia Arts Festival.","Music from the Crooked Road is a part of the Virginia Arts Festival.","Garth Fagan Dance is a part of the Virginia Arts Festival.","Porgy and Bess is presented by Virginia Opera.","A Raisin in the Sun is presented by the Virginia Stage Company.","Around the World in 80 Days is presented by the Virginia Stage Company.","Real Pirates is an exhibition from National Geographic.","Don Giovanni is presented by Virginia Opera.","Billy Bishop Goes to War is presented by the Virginia Stage Company.","The Daughter of the Regiment is now playing at the Harrison Opera House.","Romeo and Juliet is now playing at the Wells Theatre.","La Boheme is now playing at the Harrison Opera House.","Grease is now playing at Chrysler Hall.","Alive and Well is now playing at the Virginia Stage Company, Wells Theatre","An Empty Plate in the Cafe Du Grand Boeuf is now playing at the Generic Theater","Wicked","It makes the heart beat faster...","There certainly is much to admire...","There\u0027s lots of sophomoric naughtiness about sex...","... a warm Christmas offering and a welcome change...","A visit to the Wells Theatre is highly recommended.","When the curtain rises, the ubiquitous operatic happy peasants ...","Words such as - irreverent, wacky, silly, funny, hilarious, scatological, satirical, politically incorrect - all come to mind when one attempts to describe this wild, unique spoof. In case you are the last person on the planet not to know the story, it\u0027s about King Arthur and his knights searching for the Holy Grail. Except, the legend has never been told quite like this.","In days of yore plays like this one closed...","This is an elegant, stylish edition of this jazzed up Vegas style version of Verdi\u0027s AIDA. The ill fated lovers are buried alive in the sands of Egypt just as they are in the original but its more like they are buried in sequins as Elton John and Tim Rice tell the story.","This highly entertaining political satire is given an impeccable production","Fire, both literally and metaphorically, is an important element in IL TROVATORE. The principal characters are engulfed and destroyed by the flames of passion. Others have been literally been burned alive.","We\u0027ve now seen two productions by Amanda Dehnert at Virginia Stage Company. Last season she did the disappointing MAN OF LA MANCHA and this year we have the Lerner and Loewe classic, often called \"the perfect musical\", MY FAIR LADY.With superior music and George Bernard Shaw\u0027s play at it\u0027s core, this effort is more rewarding by a long shot. A Dehnert production makes it very clear that she has control of every note, word and gesture. In the program her name, printed in very bold type, is the eye-catcher of the title page She has top billing and is the star of this production.","ART OF MURDER is a comedy drama with hints of satire about the world of art and its marketing ploys and outrageous agents and dealers. Are artists great on their own merit or are they created and marketed to fame like a laundry detergent is a subtheme of this imperfect murder mystery?","John Steinbeck\u0027s title comes from a line in a poem by Robert Burns, \"The best made plans of mice and men often go awry.\" And so it is for the desperate people who see their dreams deferred or destroyed in this tale of woe that takes place in 1938.","I\u0027ve been counting the days until BLACK WATCH by Gregory Burke opened. This brilliant work, of theatre at its finest, has received virtually unprecedented rave reviews in America and around the world. Finally opening night came.","The Alvin Ailey Dance theater, which is credited with revolutionizing dance in America, is celebrating its fiftieth birthday. A short, but highly interesting film, highlighting its history is shone prior to the program of three dances.","If you act immediately you still have an opportunity to see this beautiful masterpiece of musical theatre that opened in New York in 1949. Shows of this size and crowning achievement rarely happen on Broadway any more. It stands alone as an eloquent pinnacle of the contribution of a superior score and a deeply sensitive book in the hands of exceptional theater craftsmen.","In 1896 this play caused riots in Victorian Paris.Times have changed. Fat Boy\u0027s gluttony and his wife Fudgie\u0027s desire for money and power drive them to outrageous acts of cruelty and vulgarity. This unholy couple are cartoon Macbeths in John Clancy\u0027s adaptation.Their vocabulary consists primarily of very naughty words that are bleeped on television but are no longer shocking in movies, plays or novels. People who don\u0027t want to hear or read such language simply avoid going near it.","April showers have come and","I have been slow on the up take and saw my first one on April 5 The production was Franco Zefferelli\u0027s La Boheme. It was magnificently sung Angela Georghiu as Mimi and Ramon Vargas as Rudolpho under the baton of Nicola Luisotti. This was the 349th presentation of this production.","TITANIC is in no way your standard Broadway musical. It has operatic overtones. It\u0027s music is majestic, made up of exceptionally beautiful paeans lauding the great ship, defining the characters of its assorted passengers and a few songs for comic relief.","The bed room or sex farce has pretty much vanished from the stage and taken up residence on television. These naughty but nice plays used to be bread and butter for boulevard theatre. The characters had innocence in their roguery and a subtlety lacking in most of the shows we see on the tube.","Hank Williams died at the age of 29. He is one of legions of exceptionally talented young people in the entertainment industry who have self destructed. He was a song writer/singer who transcended genre to connect with all the listeners who heard him and the musicians who came after.","I think this show opened in 1996 at the Kennedy Center under the direction of Hal Prince. Its intended Broadway residence never came into being. However, it was revived in 1998 in London and ran for two and one-half years! I have no idea what changes or revisions were done to the piece except it had a really big set. It was a hit.","The story takes place in an attic. It\u0027s the kind of attic we\u0027ve all imagined but few of us have ever been in. It\u0027s a vast, spacious intriguing place that stirs one\u0027s imagination. It\u0027s a space that is a perfect setting for all sorts of things to happen amidst the clutter and dust of time. Ghosts would love to live there. And, of course they do.","Find a very good play, a group of superior actors and","The Virginia Musical Theater has been reborn! It has become an almost fully professional company with about half of the cast of \"White Christmas\" being members of the professional actors\u0027 union. After seventeen years of struggling to produce big Broadway musicals on a shoe string, with primarily local talent, it now has a budget of 1.5 million dollars. It has a new home at the glitzy Sandler which is located smack dab in the middle of Virginia Beach\u0027s beautiful, exciting, Disney-like Towne Center. Warmest congratulations and good wishes to producer Jeff Meredith and Managing Director Mark Hudgins for their remarkable accomplishments..","Music and Lyrics by Laurence O\u0027Keefe Story and Book by Keythe Farley \u0026 Bryan Flemming The Foppish Dandies and Co. 40th Street Theatre: For this earnest, hard working, neophyte cast...","Book by Jeffrey Lane, Music and Lyrics by David Yazbe, Sevenvenues Chrysler Hall, This production suffers from a heavy handed approach to being funny...","While this offering of PIRATES, directed by William Theisen, has far more hits than misses, it gets off to a rocky start. Chris Clapps scenery is overpowering, dark and heavy as are the costumes. Like blotters, they seem to soak up the virility of the male ensemble headed by a rather cryptic, roiling Pirate King as sung Dominic M. Aquilino Lighting designer Kenneth Steadman\u0027s nervous sky is, unfortunately, a distraction.","To re-imagine Broadway musicals when they are done outside the Big Apple is hardly new. The vast majority of theatres do not have the budgets and other resources to replicate Broadway. Sometimes, though rarely, the show is helped by a leaner presentation or even a new concept. This \"re-imagined\" production, however, does little to bring new life to this highly theatrical work based on Cervantes DON QUIXOTE.","Supernatural thriller by Laura Schellhardt A Virginia Premiere Theatre Presentation \"Mary Wadkins is a conjure woman of extraordinary skill...\"","DOUBT:A drama by John Patrick Shanley Presented by Virginia Stage Company - If you\u0027re hungry for good, somewhat old-fashioned theatre that leaves you spellbound...","THE PILLOWMAN By Martin McDonagh Source Theatre at 40th Street Stage - The 2007-08 theatre season in Hampton Roads is up and stepping high...","Lyrics and Music by Leonard Bernstein Produced by Todi Music Fest at the Suffolk Center An opera in one act","The most extravagant production of a ballet...","They carve a special niche for themselves when the sophomoric humor is a veneer for real substance.","Everything about the way Rieu does music is larger than life!","The action fades in and out from Shakespeare to Hampton Roads....","NORTH STAR is at times a powerful, absorbing drama, but...","This adaptation for the stage by Christopher Sergel, which has been around for a few years, is pretty much successful as well. You may miss a favorite scene or two but Mr.Sergel captures the main dramatic elements of the still powerful story of prejudice and injustice in 1932 Alabama.","In an overall season of striking productions, Virginia Opera puts the final gem in place with CAVALLERIA RUSTICANA and I PAGLIACCI. These Bobbsey twins of opera are often done together. What is unique about the pairing in this production is that they both take place in the same Sicilian village. The highly inventive stage director Lorna Haywood came up with the idea and it works extremely well.","The great Irish playwright and critic George Bernard Shaw said Handel\u0027s operas were merely stage concerts, having no dramatic verity whatsoever. He lived well into his nineties but he must not have ever seen AGRIPPINA.","It\u0027s all nice and quite harmless and the audience loved it!","SUSANNAH is a rare theatre happening that should not be missed. It offers...","There is more substance in THE ELEPHANT MAN than we get in most of today\u0027s plays and...","The attractive Cristina Nassif, whom I feel is destined for a major career","This is truly a very special once-in-a-lifetime experience. And, we view the bodies up close, and without the smell of formaldehyde...","The one performance of this fine company was an event of comedic delight, rich beauty and refined elegance.","JOSEPH AND THE AMAZING TECHNICOLOR DREAMCOAT was originally composed as 20-minute show for a Bible school production. The piece still retains traces of its humble origin even though it has been expanded to provide a full evening\u0027s entertainment several times.","The program tells us that Alvin Ailey considered dance to be a medium for honoring the past, celebrating the present, and fearlessly reaching into the future.","ALL THE GREAT BOOKS (ABRIDGED seems to entertain on a level for most of the audience, but. . .","CONTACT is a unique theater effort. Weidman and Stroman use whatever ingredients they need, at any given moment, to serve up a dramatic dish that\u0027s fit to put before the King","If you have only seen CHICAGO once or twice, I urge you to go again. This production is as fresh as spring and full of razzle dazzle that makes chrysler Hall steam and sizzle...","The role of Norma is generally considered to be the most difficult in the soprano repertoire. It is musically taxing and dramatically demanding as well.","I don\u0027t know whether or not this production is being consdered for a New York run, but it is Broadway quality. Sandy gives it five big arfs and so do I.","Virginia stage Company has a grand, wonderfully old-fashioned play that seems tailor made for the infinite confines of the Wells Theatre. John Steinbeck\u0027s OF MICE AND MEN made me think of the kind of theatre we used to take for granted.","A ten year old girl is abducted by a serial killer. She is on her way to visit her grandmother and is never seen again.","The press release for the 136th edition of The Greatest Show on Earth urges us to forget what we thought we knew. About the circus, that is, because it has been redefined.","It\u0027s a carrousel of comedic delights propelled by romantic intrique, cunning vixens and masters of deceit caught up in situations that develope with the speed and sudden energy of a devil\u0027s broom.","I think I\u0027ve seen all the major American productions of Peter Pan with the exception of Maude Adams\u0027 rendition. On Broadway I saw Jean Arthur in the non-musical version and heard Mary Martin sing in the original musical production. Both are remembered fondly.","Lynn Nottage\u0027s INTIMATE APPAREL as done by Virginia Stage Company is an emotionally fertile, consistently entertaining and, at times, a highly amusing play.","The time is 1963, in Signal, Wyoming, a dusty, barren no-place with a lonely highway straight as an arrow slicing through it.","This is a play - at least in as we see it in this blurry production - where the author, Richard Greenberg, wants the audience to work a little to connect the dramatic dots.","Disney\u0027s The Lion King is now playing at Chrysler Hall with evening and matinee performances.","Eric Coble\u0027s delightfully satiric Bright Ideas is now playing at the Generic Theater","Romeo et Juliette is now playing at the Harrison Opera House","When Tchaikovsky decided to compose an opera from Pushkin\u0027s narrative poem, he noted that the text was \u0026deficient in theatrical opportunities\u0026. However, he felt there were many other dramatic values in the humanity and the simplicity of the story\u0026. He decided to emphasize the romantic interest and to make Tatyana and not Eugene Onegin the main character. It becomes a tale of wasted love, love not fully realized or recognized until it is too late.","A fascinating tale of beauty taken away...","EMMA\u0027S CHILD concerns the agony and pain of what can happen when a couple attempts to adopt a baby. Unable to conceive on their own, Jean and Henry decide to adopt. They agree to accept a healthy child. Instead their bundle of joy named Robin is born hydrocephalic. Such babies do not live long. Jean is determined even so to accept the baby and make him grow up normal with love and extraordinary attention. Her husband feels otherwise. Their marriage is in jeopardy.","This small group of dancers is big in talent!"],["Released","2/28/2011","2/17/2011","2/8/2011","1/24/2011","11/15/2010","11/1/2010","10/5/2010","9/28/2010","5/10/2010","5/5/2010","4/26/2010","4/19/2010","4/16/2010","4/12/2010","4/6/2010","3/1/2010","2/23/2010","2/17/2010","1/22/2010","11/17/2009","10/26/2009","10/5/2009","10/2/2009","9/22/2009","8/26/2009","5/18/2009","2/17/2009","2/6/2009","1/29/2009","1/29/2009","1/27/2009","11/20/2008","11/13/2008","10/28/2008","10/27/2008","10/20/2008","10/13/2008","9/23/2008","9/3/2008","7/7/2008","5/28/2008","5/6/2008","4/28/2008","4/24/2008","4/24/2008","4/10/2008","3/31/2008","3/10/2008","3/9/2008","2/15/2008","12/19/2007","12/19/2007","12/4/2007","11/20/2007","11/19/2007","11/12/2007","11/1/2007","10/1/2007","9/25/2007","9/25/2007","7/17/2007","5/7/2007","5/4/2007","4/23/2007","4/14/2007","3/30/2007","3/12/2007","3/12/2007","1/30/2007","1/23/2007","11/13/2006","11/9/2006","10/9/2006","6/7/2006","6/6/2006","5/3/2006","5/3/2006","4/28/2006","4/10/2006","4/7/2006","3/22/2006","3/8/2006","3/6/2006","3/3/2006","3/2/2006","1/31/2006","1/31/2006","1/25/2006","1/18/2006","1/18/2006","12/14/2005","11/17/2005","11/16/2005","","","",""],["Price","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free","Free"],["","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes"]],"pageTitle":"iTunes - Podcasts - Loessin @ Large by WHRO/WHRV","title":"","url":"https://itunes.apple.com/podcast/loessin-large/id205288291?mt\u003d2","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00032-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":870224507,"recordOffset":870176460,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{401\u003dSince 1993, Edgar Loessin has been reviewing the arts scene in Hampton Roads exclusively for WHRO-FM. His critiques of the opera, theatre and art exhibits are well known by area and national artists and listeners.}","TableContextTimeStampAfterTable":"{291818\u003dCopyright © 2014 Apple Inc. All rights reserved.}","lastModified":"Sat, 01 Aug 2015 03:43:23 GMT","textBeforeTable":"Since 1993, Edgar Loessin has been reviewing the arts scene in Hampton Roads exclusively for WHRO-FM. His critiques of the opera, theatre and art exhibits are well known by area and national artists and listeners. Description To listen to an audio podcast, mouse over the title and click Play. Open iTunes to download and subscribe to podcasts. View More by This Publisher By Ed Loessin Loessin @ Large iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To download and subscribe to Loessin @ Large by Ed Loessin, get iTunes now. iTunes is the world\u0027s easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn\u0027t open, click the iBooks app in your Dock. Opening","textAfterTable":"97 Items","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}