{"relation":[["Quest Name","A Deadly Message","Cimmerian Blue Steel","Domicile of Vileness","Dousing the Fire","Enslaved","Gold and Gore","Gone with the Wine","The Halls of the Dead","Horror Beneath the Surface","Missing Cargo, The","Prisoner\u0027s Revenge, The","Stench of Death, The"],["Starting NPC","Captain Redrik","Captain Redrik","Odetta","Turach","Claudiu","Sakumbe","Bartholomo","Litharia","Alyssa","Captain Redrik","Padraig","Alyssa"],["Quest Details","Kill thieves in the Askia portion of The Underhalls for Redrik\u0027s map. These can be a pain as this is a very popular enemy. Persistence pays off though and I got my drop on my 5th kill!","Speak to Turach just outside the city gates after picking up this quest. Turach said it was taken by thieves hiding out in The Underhalls. You\u0027ll find the bars on a worktable in the Askia portion of the zone.","Find the Lotus Box from within The Underhalls. The box is found in the Keep Dungeon portion of the zone, on the stairs near the Wine Cellar.","Collect the dusty bottles! Head south of Turach up the hill and there you will find an entrance into the Underhalls. This room is where you gather the bottles from.","Find Garus in the Askia portion of The Underhalls. He\u0027s in one of the western rooms.","Retrieve gold rings from rotten corpses. Eww. These are in the Askia portion of The Underhalls through out the area.","Kill guards to get the cell key in the Keep. It may not drop the first time, so keep at it until you get one! After you get the key, open the cell door and speak with Raboz.","You get this quest from Litharia who roams The Underhalls. She wants you to find the dying, injured, and sick prisoners. These are all near the door the goes out to Tortage harbor, on the lower level of The Underhalls.","Slay the Ceremonial Master found in the Keep Dungeon part of the The Underhalls. He\u0027s found up the ramp to the 2nd level and down the hall.","Collect the stolen pelts. These are in the Askia portion of The Underhalls and found on the walls through the area. The jewelry will end up being on a box near one of the pelts.","Take the head of one male and one female prison guard. These guys are found all over the Keep.","Find the hauler and take the note from his body. The hauler is one of the dead bodies laying around the Keep part of The Underhalls."],["Mini-Map","","","","","","","","","","","",""],["Reward","","","","","","","","","","","",""]],"pageTitle":"The Underhalls Daytime Quests | Ten Ton Hammer","title":"","url":"http://www.tentonhammer.com/node/34123","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00042-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":745799647,"recordOffset":745788309,"tableOrientation":"HORIZONTAL","lastModified":"Thu, 30 Jul 2015 04:34:37 GMT","textBeforeTable":"  Good luck to you oh brave adventurers! Be aware, this zone is actually made up of several small zone which can get very confusing. We do our best to specify which part of The Underhalls you need to be, and provide a mini-map for that section alone. Your mini-map in game will show you the overall zones of The Underhalls. The Underhalls might very well be the first real dungeon you experience in Age of Conan. This awesome zone is more than just a place to grind out kills, it holds the key to an amazing amount of Tortage Daytime Quests within it\u0027s walls. We here at Ten Ton Hammer certainly don\u0027t want to send you into such a dangerous place without a bit of guidance, so we\u0027ve provided some help for the Tortage quests that will be taking you into The Underhalls.   The Underhalls Daytime Quests The Underhalls Daytime Quests The Underhalls Daytime Quests Combat FAQ General FAQ Age of","textAfterTable":"About the Author Read more articles by Last Updated: August 29, 2008 Around the Web View Info Sites EQ Hammer Guild Wars 2 Hub Elitist Jerks","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}